app/Controllers/Login.php

SELECT *
FROM `users`
WHERE `email` = 'fy@gmail.com'
 LIMIT 1
---
    public function doLogin()
    {
        $data = $this->request->getJSON(true);

        $email = $data['email'] ?? '';
        $pwd   = $data['password'] ?? '';

        if (!$email || !$pwd) {
            return $this->response->setJSON([
                'success' => false,
                'message' => 'Veuillez remplir tous les champs.'
            ]);
        }

        $userModel = new UserModel();
        $user = $userModel->where('email', $email)->first();