app/Controllers/Register.php

        $userModel = new UserModel();

        // Vérifier si l'email existe déjà
        $existingUser = $userModel->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'fy@gmail.com'
 LIMIT 1

            'password' => password_hash($password, PASSWORD_DEFAULT)
        ];

        $userId = $userModel->insert($userData);
---
INSERT INTO `users` (`name`, `email`, `password`) VALUES ('Fy Carine', 'fy@gmail.com', '$2y$10$EcZcXn9d9VgMxXL57nJfHugsyEnLXSEF1lKk7pleLR9xVuFvuuSbu')